# Node.js Core & JavaScript Guides
## https://nodejs.org/api/
Comprehensive reference to Node.js built-in modules including file I/O (`fs`), networking (`http`, `https`), streams (`stream`), URL handling (`url`), worker threads (`worker_threads`), performance measurement (`perf_hooks`), and the ECMAScript module system (ESM). Pair with MDN's JavaScript Guide (https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/) for language fundamentals. Essential for implementing high-performance CLI commands, HTTP endpoints, and offloading CPU-intensive calculations. Last updated June 2024; maintained by Node.js Foundation (MIT-like).
## Mixed Licenses: Node.js Foundation (MIT-like), MDN (CC BY-SA 2.5)

# Worker Threads
## https://nodejs.org/api/worker_threads.html
Official Node.js documentation for CPU-bound parallelism using worker threads. Provides APIs to spawn threads, share memory via `SharedArrayBuffer`, message passing via `MessagePort`, and performance considerations for offloading intensive tasks. Crucial for scaling complex π computation algorithms without blocking the event loop. Last updated June 2024; maintained by Node.js Foundation (MIT-like).
## MIT-like

# CLI & Terminal Utilities
## https://github.com/substack/minimist
## https://github.com/chalk/chalk
## https://github.com/AndiDittrich/Node.CLI-Progress
Suite for parsing CLI flags (`minimist`), styling terminal output (`chalk`), and rendering progress bars (`cli-progress`). Enables robust handling of options (`--algorithm`, `--digits`, `--format`), styled logs, and real-time progress feedback during long-running computations. Last updated: minimist July 2023, chalk March 2024, cli-progress May 2024.
## MIT License

# Configuration & Validation Libraries
## https://github.com/nodeca/js-yaml#readme
## https://github.com/motdotla/dotenv#readme
## https://github.com/colinhacks/zod#readme
## https://json-schema.org/specification.html
Tooling for parsing YAML (`js-yaml`), environment variables (`dotenv`), runtime schema enforcement (`zod`), and formal JSON Schema contracts. Ensures configuration correctness and safe input handling for CLI flags, HTTP queries, and cache formats. Last updated 2024.
## Mixed Licenses: js-yaml (MIT), dotenv (MIT), zod (MIT), JSON Schema (CC0 1.0)

# Testing Frameworks & HTTP Testing Tools
## https://vitest.dev/guide/
## https://github.com/visionmedia/supertest
`Vitest` provides fast unit and integration testing with ES modules, mocks, and coverage. `Supertest` enables end-to-end HTTP tests against Express routes. Together they validate algorithm accuracy, CLI behavior, and API stability. Last updated April 2024 (Vitest), January 2024 (Supertest).
## MIT License

# OpenAPI Specification (OAS)
## https://spec.openapis.org/oas/v3.0.3
Standard for defining API metadata, paths, components, and JSON Schema integration. Powers `/openapi.json` generation and drives documentation-driven development. Published June 2023 under CC0 1.0 Universal.
## CC0 1.0 Universal

# Express.js API
## https://expressjs.com/en/4x/api.html
Minimal and flexible web framework for routing, middleware, error handling, and streaming responses. Powers `/pi`, `/benchmark`, and custom endpoints, integrating validation and instrumentation. Last updated May 2024.
## MIT License

# Ajv JSON Schema Validator
## https://github.com/ajv-validator/ajv
Fast JSON Schema validator with support for multiple drafts, custom keywords, and async validation. Used to validate HTTP payloads against OpenAPI schemas and ensure robust API contracts. Last updated March 2024.
## MIT License

# Prometheus Client
## https://github.com/siimon/prom-client#readme
Comprehensive guide to instrumenting Node.js applications with Prometheus metrics. Covers counters, gauges, histograms, summaries, default metrics, and exposing a `/metrics` endpoint. Essential for real-time monitoring of π computation throughput and API performance. Last updated April 2024.
## MIT License

# Benchmarking Library
## https://benchmarkjs.com/
High-resolution benchmarking with statistical analysis and asynchronous test support. Ideal for comparing π algorithm performance consistently and collecting reproducible metrics. Last updated January 2024.
## MIT License

# Arithmetic & Numeric Libraries
## https://github.com/MikeMcl/decimal.js#readme
## https://mathjs.org/docs/datatypes/bignumber.html
## https://github.com/davidbau/seedrandom
Libraries for arbitrary-precision decimals (`decimal.js`), big numbers (`math.js`), and seedable RNG (`seedrandom`). Offer configurable precision, rounding modes, and reproducible performance benchmarks. Last updated 2024.
## Mixed Licenses: decimal.js (MIT), math.js (Apache-2.0), seedrandom (MIT)

# Chart.js & node-canvas Integration
## https://www.chartjs.org/docs/latest/
## https://github.com/Automattic/node-canvas
## https://github.com/SeanSobey/ChartjsNodeCanvas
Guides and APIs for server-side chart generation using Chart.js on a headless Canvas. Demonstrates chart configuration, plugin use, and rendering static PNGs for error plots and performance graphs. Last updated May 2024.
## MIT License

# EJS Templates
## https://ejs.co/#docs
Documentation for embedding JavaScript in HTML using EJS templates. Covers syntax, partials, filters, and layouts for dynamic report generation and interactive documentation pages. Last updated 2024.
## MIT License

# Pi Calculation Algorithms Reference
## https://en.wikipedia.org/wiki/Pi
An overview page linking to core π calculation algorithms (Chudnovsky, BBP, Gauss–Legendre, Leibniz). Provides mathematical derivations, convergence rates, error bounds, and implementation considerations. Use as authoritative reference for algorithm design, truncation criteria, and verification of computed digits. Last updated March 2024; maintained under CC BY-SA 3.0.
## CC BY-SA 3.0

# Yargs CLI Parser
## https://github.com/yargs/yargs#readme
Comprehensive guide for building interactive command-line tools in Node.js. Covers argument parsing, subcommands, validation, commands chaining, and custom help text. Ideal for implementing the `--digits` and `--algorithm` flags, generating usage documentation, and providing consistent CLI behavior. Last updated May 2024.
## MIT License

# Piscina Worker Pool
## https://github.com/piscinajs/piscina#readme
High-performance worker thread pool for Node.js, abstracting thread management, task queuing, and memory sharing. Offers simple API to offload CPU-intensive π computation tasks with built-in concurrency controls and error propagation. Enables scalable parallel execution with minimal boilerplate. Last updated June 2024.
## MIT License